OpenFOAM/ERCOFTAC-SIG15/case13.1/alpha_0/Allrun
#!/bin/sh

./Allrun.pre
[ "$1" = "-m" ] && ./Allrun.monitor &
./Allrun.solve
./Allrun.post
./Allrun.plot
