OpenFOAM/ERCOFTAC-SIG15/case13.1/alpha_0/Allrun.monitor
#!/bin/sh
file=postProcessing/residuals/0/residuals.dat
while [ ! -f  $file ]
do
  sleep 1
done

foamMonitor -l $file &
