OpenFOAM/ERCOFTAC-SIG15/case13.1/alpha_0/Allrun.pre
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

if [ -d constant/polyMesh.orig ]
then
    cp -a constant/polyMesh.orig/* constant/polyMesh/
elif [ -f system/blockMeshDict ]
then
    runApplication blockMesh
fi
runApplication checkMesh -constant 
